src/test/resources/stripe-subscription-charge-success.json

{
  "id": "evt_3NcEBfHAwJOu5brr1esQf6Ut",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1691356112,
  "data": {
    "object": {
      "id": "pi_3NcEBfHAwJOu5brr1mtwduxc",
      "object": "payment_intent",
      "amount": 10500,
      "amount_capturable": 0,
      "amount_details": {
        "tip": {
        }
      },
      "amount_received": 10500,
      "application": "ca_9gE5S2SsGFB6QVRazAnjZfdeGmeiAYOq",
      "application_fee_amount": 200,
      "automatic_payment_methods": null,
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic",
      "charges": {
        "object": "list",
        "data": [
          {
            "id": "ch_3NcEBfHAwJOu5brr1LzoApRe",
            "object": "charge",
            "amount": 10500,
            "amount_captured": 10500,
            "amount_refunded": 0,
            "application": "ca_9gE5S2SsGFB6QVRazAnjZfdeGmeiAYOq",
            "application_fee": null,
            "application_fee_amount": 200,
            "balance_transaction": "txn_3NcEBfHAwJOu5brr16lTFz0o",
            "billing_details": {
              "address": {
                "city": null,
                "country": null,
                "line1": null,
                "line2": null,
                "postal_code": "46814",
                "state": null
              },
              "email": null,
              "name": null,
              "phone": null
            },
            "calculated_statement_descriptor": "IMPACT UPGRADE",
            "captured": true,
            "created": 1691356112,
            "currency": "usd",
            "customer": "cus_JPgkris8GTsXIH",
            "description": "Subscription creation",
            "destination": null,
            "dispute": null,
            "disputed": false,
            "failure_balance_transaction": null,
            "failure_code": null,
            "failure_message": null,
            "fraud_details": {
            },
            "invoice": "in_1NcEBfHAwJOu5brrTDL0qSar",
            "livemode": false,
            "metadata": {
            },
            "on_behalf_of": null,
            "order": null,
            "outcome": {
              "network_status": "approved_by_network",
              "reason": null,
              "risk_level": "normal",
              "risk_score": 34,
              "seller_message": "Payment complete.",
              "type": "authorized"
            },
            "paid": true,
            "payment_intent": "pi_3NcEBfHAwJOu5brr1mtwduxc",
            "payment_method": "card_1NcEBeHAwJOu5brrsiacstBK",
            "payment_method_details": {
              "card": {
                "brand": "visa",
                "checks": {
                  "address_line1_check": null,
                  "address_postal_code_check": "pass",
                  "cvc_check": "pass"
                },
                "country": "US",
                "exp_month": 12,
                "exp_year": 2026,
                "fingerprint": "WHTBeQ5HmOeHlWfu",
                "funding": "credit",
                "installments": null,
                "last4": "4242",
                "mandate": null,
                "network": "visa",
                "network_token": {
                  "used": false
                },
                "three_d_secure": null,
                "wallet": null
              },
              "type": "card"
            },
            "receipt_email": null,
            "receipt_number": null,
            "receipt_url": "https://pay.stripe.com/receipts/invoices/CAcaFwoVYWNjdF8xSW1xdTNIQXdKT3U1YnJyKNKXwKYGMgZrSQqZpDw6LBaDU8VYS0Lwmn1XbMntgWC0_GAaoe-D91yO84M6H6e-4ZtW8Na7ng4eJYPI?s=ap",
            "refunded": false,
            "refunds": {
              "object": "list",
              "data": [
              ],
              "has_more": false,
              "total_count": 0,
              "url": "/v1/charges/ch_3NcEBfHAwJOu5brr1LzoApRe/refunds"
            },
            "review": null,
            "shipping": null,
            "source": {
              "id": "card_1NcEBeHAwJOu5brrsiacstBK",
              "object": "card",
              "address_city": null,
              "address_country": null,
              "address_line1": null,
              "address_line1_check": null,
              "address_line2": null,
              "address_state": null,
              "address_zip": "46814",
              "address_zip_check": "pass",
              "brand": "Visa",
              "country": "US",
              "customer": "cus_JPgkris8GTsXIH",
              "cvc_check": "pass",
              "dynamic_last4": null,
              "exp_month": 12,
              "exp_year": 2026,
              "fingerprint": "WHTBeQ5HmOeHlWfu",
              "funding": "credit",
              "last4": "4242",
              "metadata": {
              },
              "name": null,
              "tokenization_method": null,
              "wallet": null
            },
            "source_transfer": null,
            "statement_descriptor": null,
            "statement_descriptor_suffix": null,
            "status": "succeeded",
            "transfer_data": null,
            "transfer_group": null
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/charges?payment_intent=pi_3NcEBfHAwJOu5brr1mtwduxc"
      },
      "client_secret": "pi_3NcEBfHAwJOu5brr1mtwduxc_secret_GRpqUnpHU0tLaQ6VgnFXwztqv",
      "confirmation_method": "automatic",
      "created": 1691356111,
      "currency": "usd",
      "customer": "cus_JPgkris8GTsXIH",
      "description": "Subscription creation",
      "invoice": "in_1NcEBfHAwJOu5brrTDL0qSar",
      "last_payment_error": null,
      "latest_charge": "ch_3NcEBfHAwJOu5brr1LzoApRe",
      "livemode": false,
      "metadata": {
      },
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": null,
      "payment_method_options": {
        "card": {
          "installments": null,
          "mandate_options": null,
          "network": null,
          "request_three_d_secure": "automatic"
        },
        "cashapp": {
        }
      },
      "payment_method_types": [
        "card",
        "cashapp"
      ],
      "processing": null,
      "receipt_email": null,
      "review": null,
      "setup_future_usage": "off_session",
      "shipping": null,
      "source": "card_1NcEBeHAwJOu5brrsiacstBK",
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "succeeded",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": "req_7SkDQ09JTmFDvS",
    "idempotency_key": "472e1a35-bece-4c0c-8e17-8759bca0b97f"
  },
  "type": "payment_intent.succeeded"
}